{
    "personalInformation": {
        "name": "Viswachand Akkanambattu",
        "title": "Software Engineer",
        "contact": {
            "phone": "+1 2164631168",
            "email": "viswachandakkanambattu@gmail.com",
            "github": "https://github.com/viswachand",
            "linkedin": "https://www.linkedin.com/in/viswachand-akkanambattu-9aa558147/",
            "visaStatus": "F1 Valid Thru 07/2028"
        }
    },
    "aboutUs": {
        "title": "About",
        "summary": [
            "As a Software Engineer with 4.5 years of professional experience, I specialize in developing robust and scalable web applications that deliver exceptional performance and user experiences.",
            "During my industry experience, I have significantly worked on the design, development, and management of user-centric, responsive, and scalable front-end applications, ensuring seamless functionality and exceptional user experiences. This has helped me gain substantial exposure to various front-end technologies, including modern JavaScript frameworks and libraries, both in traditional and cloud-native environments. Additionally, I have developed a solid foundation in problem-solving, UI/UX design principles, state management, component-based architecture, web performance optimization, and automating front-end workflows using modern development tools. I enjoy working on challenging projects as they provide ample learning opportunities, contributing to my technical and professional growth, and I aim to continue doing so.",
            "Outside of work, I enjoy photography, watching movies, and exploring the beauty of nature."
        ]
    },
    "keyCompetencies": [
        {
            "title": "Accountable :",
            "description": "Proven experience in delivering high-impact results"
        },
        {
            "title": "Team player :",
            "description": "Great collaboration skills"
        },
        {
            "title": "Agile and adaptable:",
            "description": "Can quickly adapt to changing requirements"
        },
        {
            "title": "Positive influence :",
            "description": "Optimistic driver of new initiatives"
        }
    ],
    "education": [
        {
            "degree": "Master of Science (MS) in Computer Science",
            "url": "https://www.csuohio.edu/",
            "institution": "Cleveland State University",
            "year": "2023-2025",
            "location": "Cleveland, United States",
            "honors": "Computer Science"
        },
        {
            "degree": "Bachelor of Technology",
            "url": "https://www.kalasalingam.ac.in/",
            "institution": "Kalasalingam University",
            "year": "2015-2019",
            "location": "Krishankovil, India",
            "honors": "Electronics and Communication"
        }
    ],
    "skills": [
        {
            "title": "Programming Languages",
            "items": [
                "HTML5",
                "CSS/SCSS/SASS",
                "JavaScript",
                "TypeScript",
                "Java",
                "Python",
                "SQL"
            ]
        },
        {
            "title": "Frontend Technologies",
            "items": [
                "React.js",
                "Next.js",
                "Angular",
                "Tailwind CSS",
                "Material-UI",
                "Bootstrap",
                "Redux"
            ]
        },
        {
            "title": "Backend Technologies",
            "items": [
                "Node.js",
                "Express.js",
                "Restful APIs",
                "GraphQL"
            ]
        },
        {
            "title": "Databases",
            "items": [
                "MongoDB",
                "MySQL",
                "PostgreSQL"
            ]
        },
        {
            "title": "Version Control Tools",
            "items": [
                "Git"
            ]
        },
        {
            "title": "Modern Authentication Mechanisms",
            "items": [
                "JSON Web Tokens (JWT)",
                "OAuth2"
            ]
        }
    ],
    "experience": [
        {
            "company": "Cleveland State University",
            "url": "https://csuohio.edu/",
            "buttonText": "Find CSU journey in this article",
            "title": "Software Engineer Intern",
            "location": "Cleveland, OH, USA",
            "duration": "September 2024 to May 2025",
            "journey": "https://medium.com/@viswachand19/csu-journey-336e7104c2f6",
            "Description": [
                "Cleveland State University is a public research university in Cleveland, Ohio. As a Software Engineer Intern, I contributed to innovative projects that enhance campus technology and student services. My role involved designing and implementing scalable software solutions to improve student experience and operational efficiency.",
                "Collaborated on student portal architecture, contributing to microservices-based design discussions and supporting scalability improvements.",
                "Redesigned and optimized Student & Teacher feedback pages, reducing page load time by 40% and enhancing user satisfaction.",
                "Strengthened application security by applying best practices, lowering potential vulnerabilities by 25% in testing."
            ]
        },
        {
            "company": "Moonraft Innovation Labs",
            "url": "https://moonraft.com/",
            "buttonText": "Find Moonraft journey in this article",
            "title": "Software Engineer",
            "location": "Bangalore, India",
            "duration": "July 2022 to August 2023",
            "journey": "https://medium.com/@viswachand19/moonraft-journey-336e7104c2f6",
            "Description": [
                "Moonraft Innovation Labs is a customer experience and innovation firm that combines design, technology, and data to deliver cutting-edge digital solutions. As a member of the Full Stack Developer team, I contributed to a project for Punjab National Bank, a leading institution in the Banking and Financial Services sector specializing in secure payment processing. My role involved developing a comprehensive end-to-end solution to streamline customer onboarding through both a mobile application and an online web platform.",
                "Engineered a performant, data-intensive onboarding application, creating a smooth user experience for complex workflows (KYC, e-signatures) that reduced customer onboarding time by 60%",
                "Built the front end for a modular loan approval engine, creating a data-rich interface that handled complex logic and large datasets of dynamic rules, resulting in a 70",
                "Demonstrated strong product intuition by collaborating with product and design partners to integrate REST APIs, balancing thoughtful technical decisions with speed to enhance regulatory traceability and deliver user value"
            ]
        },
        {
            "company": "Good Crop It Pvt Ltd,",
            "url": "https://goodcorpit.com/",
            "buttonText": " Find Good Crop journey in this article",
            "title": "Front-End Developer",
            "location": "Hyderbad, India",
            "duration": "Feb 2020 to Jun 2022",
            "journey": "https://medium.com/@viswachand19/goodcorpit-pvt-ltd-journey-d77cf7f6cf6f",
            "Description": [
                "Goodcorpit is a comprehensive research and review platform that assists software buyers and service seekers in choosing the best software or service providers. As a Front-End Developer, I worked on two projects. I played a pivotal role in migrating a warehouse management system from IBM AS400 to React.js. The second project involved the development of an animal warehouse management solution.",
                "Migrated legacy AS400-based system to modern web applications with enhanced UI/UX using React.js, Redux, and Node.js, improving usability and maintainability for warehouse operations",
                "By migrating the application to React.js with an optimized UI/UX, significantly enhanced the efficiency of inbound and outbound logistics operations, leading to a 45% increase in processing throughput and improved real-time visibility for warehouse teams.",
                "Built reusable React components with Redux integration for FedEx and USPS shipping workflows, enabling real-time tracking and order placement; collaborated with warehouse staff, product managers, and backend teams to ensure seamless end-to-end logistics functionality and barcode scanning accuracy."
            ]
        }
    ],
    "references": {
        "availableOnRequest": true
    }
}